<?php

return [

	'success' => [

		'insert'	=> '.درخواست با موفقیت درج شده است',

		'delete'	=> '.درخواست با موفقیت پاک شده است',

		'update'	=> '.درخواست با موفقیت ویرایش  شده است'

	],

	1001 => [
		'message' => '.درخواست مورد نظر پیدا نشد',
		'type' => 'error'
	],

	1002 => [
		'message' => '.کاربر مورد نظر موجود نیست',
		'type' => 'error'
	],

	1003 => [
		'message' => '.نوع کاربری وارد نشده است',
		'type' => 'error'
	],

	1004 => [
		'message' => '.خطا برای تکراری بودن',
		'type' => 'error'
	],

	1005 => [
		'message' => '.خطا برای تکراری بودن نقش کاربر',
		'type' => 'error'
	],

	3001 => [
		'message' => '.شما لاگین نیستید',
		'type' => 'error',
		'cat' => 'auth',
		'short' => 'not-logged-on'
	],

	3002 => [
		'message' => '.اپ توکن درست تولید نشده است',
		'type' => 'error',
		'cat' => 'auth'
	],

	3003 =>[
		'message' => '.توکن کاربر درست تولید نشده است',
		'type' => 'error',
		'cat' => 'auth'
	],

	3004 => [
		'message' => '.هیچ آژانسی به توکن دسترسی ندارد',
		'type' => 'error',
		'cat' => 'auth'
	],

	3005 => [
		'message' => '.توکن درخواست شده شمامل اطلاعات کاربر نیست',
		'type' => 'error',
		'cat' => 'auth'
	],

	3006 => [
		'message' => '.توکن درخواستی ست نشده است',
		'type' => 'error',
		'cat' => 'auth'
	],

	3007 => [
		'message' => '.توکن نمایش داده نمیشود',
		'type' => 'error',
		'cat' => 'auth'
	],

	3008 => [
		'message' => '.توکن برای شناسایی کاربر تولید نمیشود',
		'type' => 'error',
		'cat' => 'auth'
	],

	3009 => [
		'message' => '.توکن تولید نمیشود',
		'type' => 'error',
		'cat' => 'auth'
	],

	3010 => [
		'message' => '.زمان استفاده از توکن گذشته است',
		'type' => 'error',
		'cat' => 'auth'
	],

	3011 => [
		'message' => '.توکن معتبر نیست',
		'type' => 'error',
		'cat' => 'auth'
	],

	3012 => [
		'message' => '.توکن در لیست سیاه',
		'type' => 'error',
		'cat' => 'auth'
	],

	3013 => [
		'message' => '.Payload معتبر نیست',
		'type' => 'error',
		'cat' => 'auth'
	],

	3014 => [
		'message' => '.Claim معتبر نیست',
		'type' => 'error',
		'cat' => 'auth'
	],

	3015 => [
		'message' => '.خطا به دلیل اعتبار سنجی توکن',
		'type' => 'error',
		'cat' => 'auth'
	],

	5401 => [
		'message' => '.شناسایی کاربر نامعتبر است',
		'type' => 'error'
	],

	5404 => [
		'message' => '.صفحه درخواست شده پیدا نمیشود',
		'type' => 'error'
	],

	5405 => [
		'message' => '.شما به درخواستی که داده اید دسترسی ندارید',
		'type' => 'error'
	],

	5406 => [
		'message' => '.پارامترهایی که شما وارد کرده اید نا معتبر است',
		'type' => 'error'
	],

	5420 => [
		'message' => '.خطای اعتبار سنجی',
		'type' => 'error'
	],

	5422 => [
		'message' => '.توکن نامعتبر است',
		'type' => 'error'
	],

	5445 => [
		'message' => '.ارتباط با پایگاه داده مشکل دارد',
		'type' => 'error'
	],

	5448 => [
		'message' => '.عملیات درج درست اجرا نشده است',
		'type' => 'error'
	],

	5447 => [
		'message' => '.عملیات پاک کردن درست اجرا نشده است',
		'type' => 'error'
	],

	5449 => [
		'message' => '.عملیات ویرایش درست اجرا نشده است',
		'type' => 'error'
	]

];
